read_verilog ../vAndBlif/task4.v 

setattr -set keep wire_name 
write_blif  ../vAndBlif/task4.blif